Revit 2024 API
BumpMap.BumpmapBitmap Property
 The property labeled "Source" from the "BumpMap" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string BumpmapBitmap { get; }
Visual Basic
Public Shared ReadOnly Property BumpmapBitmap As String
	Get
Visual C++
public:
static property String^ BumpmapBitmap {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyString" and will contain a relative path.
See Also
BumpMap Class
Autodesk.Revit.DB.Visual Namespace